
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ИнтерактивныйРежим = Истина;
	
	Объект.ТестовыйРежим = Истина;
	
	Объект.ОткрыватьЛоги = Истина;
	
	Объект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура УзелПланаОбменаОткрытие(Элемент, СтандартнаяОбработка)
	Стандартнаяобработка = Ложь;
	ОбменДаннымиКлиент.ОткрытьСоставОтправляемыхДанных(Объект.УзелПланаОбмена);
КонецПроцедуры

&НаКлиенте
Процедура ВизуализацияОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Перем ИмяПоля;
	СтандартнаяОбработка = Ложь;
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Объект.ДанныеРасшифровки, Расшифровка, ИмяПоля);
	Если ЗначениеЗаполнено(ЗначениеРасшифровки) Тогда
		
		Отказ = Ложь;
		
		Если ИмяПоля = "data.relationships.entries.links.related" Тогда
			НавигацияВОтчетеПоСсылке(ЗначениеРасшифровки, "ENTRIES", "orderentries", Отказ);
		Иначе
			ПоказатьЗначение(,ЗначениеРасшифровки);
			Возврат;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Элемент.ТекущаяОбласть.ЦветТекста = Новый Цвет(139, 0, 139);
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНавигацияПоДеталям;
			Элементы.ГруппаНавигацияПоДеталям.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура НавигацияПоДеталямОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Перем ИмяПоля;
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Объект.АдресВременноеХранилище, Расшифровка, ИмяПоля);
	Если ЗначениеЗаполнено(ЗначениеРасшифровки) Тогда
		ПоказатьЗначение(,ЗначениеРасшифровки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(АдресХранилища, Знач Расшифровка, ИмяПоля)

	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(АдресХранилища);
	ПоляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	Если ПоляРасшифровки.Количество() = 1 Тогда	
		ЗначениеПоля = ПоляРасшифровки.Получить(0);
		ИмяПоля = ЗначениеПоля.Поле;
		Возврат ЗначениеПоля.Значение;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервере
Процедура НавигацияВОтчетеПоСсылке(Знач Адрес, Знач Макет, Знач ТипОбъекта, Отказ = Ложь)

	РК = РеквизитФормыВЗначение("Объект");
	Сообщение = "";
	Если РК.НавигацияВОтчетеПоСсылке(НавигацияПоДеталям, Адрес, Макет, ТипОбъекта, Сообщение) Тогда
		ЗначениеВРеквизитФормы(РК, "Объект");
		СсылкаПоДеталям = Адрес;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьКомандуВнешнейОбработки(Действие, ВремяЗапуска = Неопределено, ВремяЗавершения = Неопределено)
	
	ВремяЗапуска = ТекущаяДатаСеанса();
	РК = РеквизитФормыВЗначение("Объект");

	РК.ВыполнитьКоманду(Действие, Неопределено);
	
	ЗначениеВРеквизитФормы(РК, "Объект");
	ВремяЗавершения = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВнешнейОбработки(Команда)
	
	Перем ВремяЗапуска, ВремяЗавершения;
	ВыполнитьКомандуВнешнейОбработки(Команда.Имя, ВремяЗапуска, ВремяЗавершения);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВизуализация;
	
	
	Если Объект.ОткрыватьЛоги Тогда
		
		Отбор = Новый Структура("Пользователь, СобытиеЖурналаРегистрации, ДатаНачала, ДатаОкончания, Данные, Сеанс, Уровень");
	
		Отбор.ДатаНачала = ВремяЗапуска;
		Отбор.ДатаОкончания = ВремяЗавершения;
		Отбор.СобытиеЖурналаРегистрации = СобытиеЖурналаРегистрации(Команда.Имя);
			
		ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор, ЭтаФорма);

	КонецЕсли;
	
	Если ПустаяСтрока(Объект.АдресВременноеХранилище) Тогда
		Возврат;
	КонецЕсли;

	ИмяФайла = Неопределено;
	Если ОбнаружитьФайлДляОтображения(Объект.АдресВременноеХранилище, ИмяФайла) Тогда
		ТД = Новый ТекстовыйДокумент;
		ПрочитатьВТекстовыйДокумент(ТД, ИмяФайла);
		ТД.Показать("Остатки для маркетплейса");
	КонецЕсли;
	
	//ПоместитьВоВременноеХранилище(Неопределено, Объект.УникальныйИдентификатор);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбнаружитьФайлДляОтображения(Адрес, ИмяФайла)
	
	Если ПустаяСтрока(Адрес) Тогда
		Возврат Ложь;
	КонецЕсли;

	ИнформацияДляПоказа = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ТипЗнч(ИнформацияДляПоказа) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИнформацияДляПоказа.Свойство("ИмяФайла", ИмяФайла) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции	

&НаСервереБезКонтекста
Функция ПрочитатьВТекстовыйДокумент(ТД, ИмяФайла)
	ТД.Прочитать(ИмяФайла);
КонецФункции	

&НаСервере
Функция СобытиеЖурналаРегистрации(Параметр = Неопределено)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьИмяСобытия(Параметр);
КонецФункции

&НаКлиенте
Процедура ОтчетПриИзменении(Элемент)

	Если ВыполнитьОтчет = "" Тогда
		Возврат;
	КонецЕсли;

	ПрименитьВизуализацию(ВыполнитьОтчет);
	ВыполнитьОтчет = "";
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВизуализация;
	ТекущийЭлемент = Элементы.Визуализация;
	Элементы.ГруппаНавигацияПоДеталям.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ПрименитьВизуализацию(Действие, ДопПараметры = Неопределено)
	
	Элементы.Визуализация.Доступность = Ложь;
	РК = РеквизитФормыВЗначение("Объект");
	РК.ПрименитьВизуализацию(Действие, ДопПараметры);
	ЗначениеВРеквизитФормы(РК, "Объект");
	Элементы.Визуализация.Доступность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЛоги(Команда)
	
	ИмяСобытия = СобытиеЖурналаРегистрации();
	Отбор = ПолучитьОтборПоВсемСобытиям(ИмяСобытия);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтборПоВсемСобытиям(ИмяСобытия)

	Отбор = Новый Структура("Пользователь, СобытиеЖурналаРегистрации, ДатаНачала, ДатаОкончания, Данные, Сеанс, Уровень");
	
	ЗначенияОтбора = ПолучитьЗначенияОтбораЖурналаРегистрации("Событие");
	
	СписокСобытий = Новый Массив();
	Для Каждого К Из ЗначенияОтбора.Событие Цикл
		Если Найти(К.Ключ, ИмяСобытия) > 0 Тогда
			СписокСобытий.Добавить(К.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокСобытий.Количество() > 0 Тогда
		Отбор.СобытиеЖурналаРегистрации = СписокСобытий;
	КонецЕсли;
	
	Возврат Отбор;

КонецФункции

